Documents/бит_ЗакрытиеСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЗакрытиеСчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_ЗакрытиеСчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииОбщегоНазначения

Процедура ЗакрытиеСчетов20(СтруктураШапкиДокумента, Отказ) Экспорт
	
	ПараметрыПроведения = Документы.бит_ЗакрытиеСчетов.ПодготовитьПараметрыЗакрытиеСчета20(СтруктураШапкиДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	ТаблицаПроводок = бит_ЗакрытиеМесяца.ПодготовитьТаблицыЗакрытиеСчета20(ПараметрыПроведения.ТаблицаРеквизитыЗакрытие20, Отказ,  ТекстСообщения);
	
	Если НЕ Отказ Тогда
		СформироватьДвиженияЗакрытиеЗакрытиеСчета20(ТаблицаПроводок, ПараметрыПроведения.ТаблицаРеквизитыЗакрытие20, Отказ);
	Иначе
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011
//
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект
	
	,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")
	
	,ПараметрОбъектКопирования);
	
КонецПроцедуры

// Функция выполняет проверку на повторное закрытие месяца.
//
Функция ПроверкаПовторовДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца" ,НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца"  ,КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация"  ,Организация);
	Запрос.УстановитьПараметр("Ссылка"       ,Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_ЗакрытиеСчетов.Ссылка,
	|	бит_ЗакрытиеСчетов.Проведен,
	|	бит_ЗакрытиеСчетов.Организация,
	|	бит_ЗакрытиеСчетов.Дата
	|ИЗ
	|	Документ.бит_ЗакрытиеСчетов КАК бит_ЗакрытиеСчетов
	|ГДЕ
	|	бит_ЗакрытиеСчетов.Организация = &Организация
	|	И бит_ЗакрытиеСчетов.Дата >= &НачалоМесяца
	|	И бит_ЗакрытиеСчетов.Дата <= &КонецМесяца
	|	И НЕ бит_ЗакрытиеСчетов.ПометкаУдаления
	|	И бит_ЗакрытиеСчетов.Ссылка <> &Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ТекстСообщения = "";
	Если Не Результат.Пустой() тогда
		ТекстСообщения = ТекстСообщения + "Документ в данном месяц уже создан.";
	КонецЕсли;
	Возврат ТекстСообщения;
	
Конецфункции

Функция ЗаполнитьСтруктуруШапкиДокумента(Отказ, Заголовок) Экспорт
	
	СтруктураШапки      = Новый Структура();
	
	СтруктураШапки.Вставить("НачДата",                 НачалоМесяца(Дата));
	СтруктураШапки.Вставить("КонДата",                 КонецМесяца(Дата));
	СтруктураШапки.Вставить("НачГраница",              Новый Граница(СтруктураШапки.НачДата, ВидГраницы.Исключая));
	СтруктураШапки.Вставить("КонГраница",              Новый Граница(СтруктураШапки.КонДата, ВидГраницы.Включая));
	СтруктураШапки.Вставить("НачГода",                 НачалоГода(Дата));
	СтруктураШапки.Вставить("Организация",             Организация);
	СтруктураШапки.Вставить("Ссылка",                  Ссылка);
	СтруктураШапки.Вставить("Дата",                    Дата);
	СтруктураШапки.Вставить("Номер",                   Номер);
	СтруктураШапки.Вставить("Заголовок",               Заголовок);
	
	Возврат СтруктураШапки;
	
КонецФункции // ЗаполнитьСтруктуруШапкиДокумента()

#КонецОбласти

#Область ПроцедурыИФункцииОбеспеченияПроведенияДокумента

Процедура СформироватьДвиженияЗакрытиеЗакрытиеСчета20(ТаблицаПроводок, ТаблицаРеквизиты, Отказ) Экспорт
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Для каждого Запись Из ТаблицаПроводок Цикл
		
		Проводка = Движения.Хозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, Запись);
		
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = Реквизиты.Организация;
		Проводка.Содержание  = Реквизиты.Содержание;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Запись.СубконтоКт1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Запись.СубконтоКт2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Запись.СубконтоДт1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Запись.СубконтоДт2);
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры // СформироватьДвиженияЗакрытиеЗакрытиеСчетов90_91()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаУдаленияПроведения" .
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения" .
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	бит_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект, Ложь);
	Если РучнаяКорректировка Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	Заголовок   = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	СтруктураШапкиДокумента = ЗаполнитьСтруктуруШапкиДокумента(Отказ, Заголовок);
	
	ЗакрытиеСчетов20(СтруктураШапкиДокумента, Отказ);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" .
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ПроверкаПовторовДокументов();
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ЭтотОбъект));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаЗаполнения" .
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента();
	
	Дата = КонецМесяца(ТекущаяДатаСеанса()) - 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
